; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v7 - type_1 ?v2 - type_3)
 	      (pred_3 ?v8 - object ?v2 - type_3)
	      (pred_4 ?v7 - type_1 ?v4 - type_2)
	      (pred_2 ?v7 - type_1 ?v8 - object ?v4 - type_2))

   (:action op_3
       :parameters  (?v7 - type_1 ?v6 ?v5 - type_3)
       :precondition (and  (pred_1 ?v7 ?v6))
       :effect (and  (pred_1 ?v7 ?v5)
		     (not (pred_1 ?v7 ?v6))))

   (:action op_1
       :parameters (?v7 - type_1 ?v1 - object ?v3 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v3) (pred_1 ?v7 ?v3) (pred_4 ?v7 ?v4))
       :effect (and (pred_2 ?v7 ?v1 ?v4)
		    (not (pred_3 ?v1 ?v3)) 
		    (not (pred_4 ?v7 ?v4))))

   (:action op_2
       :parameters (?v7 - type_1 ?v1 - object ?v3 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_2 ?v7 ?v1 ?v4) (pred_1 ?v7 ?v3))
       :effect (and (pred_3 ?v1 ?v3)
		    (pred_4 ?v7 ?v4)
		    (not (pred_2 ?v7 ?v1 ?v4)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_12 obj_06 - type_1
obj_13 obj_02 obj_10 obj_01 - type_2
obj_05 obj_08 obj_04 obj_03 - type_3
obj_09 obj_11 obj_07 - object)
(:init
(pred_1 obj_12 obj_05)
(pred_4 obj_12 obj_13)
(pred_4 obj_12 obj_02)
(pred_1 obj_06 obj_08)
(pred_4 obj_06 obj_10)
(pred_4 obj_06 obj_01)
(pred_3 obj_09 obj_04)
(pred_3 obj_11 obj_08)
(pred_3 obj_07 obj_04)
)
(:goal
(and
(pred_3 obj_09 obj_03)
(pred_3 obj_11 obj_05)
(pred_3 obj_07 obj_03)
)
)

(:constraints
  (always (not (pred_1 obj_12 obj_04)))
)
)

; plan
1. (op_1 obj_06 obj_11 obj_08 obj_01)
   deleted: (pred_3 obj_11 obj_08) (pred_4 obj_06 obj_01)
   added: (pred_2 obj_06 obj_11 obj_01)
   goals met: 0 of 3
2. (op_3 obj_12 obj_05 obj_03)
   deleted: (pred_1 obj_12 obj_05)
   added: (pred_1 obj_12 obj_03)
   goals met: 0 of 3
3. (op_3 obj_06 obj_08 obj_05)
   deleted: (pred_1 obj_06 obj_08)
   added: (pred_1 obj_06 obj_05)
   goals met: 0 of 3
4. (op_2 obj_06 obj_11 obj_05 obj_01)
   deleted: (pred_2 obj_06 obj_11 obj_01)
   added: (pred_3 obj_11 obj_05) (pred_4 obj_06 obj_01)
   goals met: 1 of 3
5. (op_3 obj_06 obj_05 obj_04)
   deleted: (pred_1 obj_06 obj_05)
   added: (pred_1 obj_06 obj_04)
   goals met: 1 of 3
6. (op_1 obj_06 obj_09 obj_04 obj_01)
   deleted: (pred_3 obj_09 obj_04) (pred_4 obj_06 obj_01)
   added: (pred_2 obj_06 obj_09 obj_01)
   goals met: 1 of 3
7. (op_1 obj_06 obj_07 obj_04 obj_10)
   deleted: (pred_3 obj_07 obj_04) (pred_4 obj_06 obj_10)
   added: (pred_2 obj_06 obj_07 obj_10)
   goals met: 1 of 3
8. (op_3 obj_06 obj_04 obj_03)
   deleted: (pred_1 obj_06 obj_04)
   added: (pred_1 obj_06 obj_03)
   goals met: 1 of 3
9. (op_2 obj_06 obj_07 obj_03 obj_10)
   deleted: (pred_2 obj_06 obj_07 obj_10)
   added: (pred_3 obj_07 obj_03) (pred_4 obj_06 obj_10)
   goals met: 2 of 3
10. (op_2 obj_06 obj_09 obj_03 obj_01)
   deleted: (pred_2 obj_06 obj_09 obj_01)
   added: (pred_3 obj_09 obj_03) (pred_4 obj_06 obj_01)
   goals met: 3 of 3
